ERP.belugaerp/src/InformationRegisters/бг_НастройкиСогласованияЗаказовКлиентов/бг_НастройкиСогласованияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_НастройкиСогласованияЗаказовКлиентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТребуетсяКредитныйЛимит</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяВизаФК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяВизаКК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяВизаСБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтосогласованиеФК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтосогласованиеКК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтосогласованиеСБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопСогласованиеСБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьПодтверждениеВ_ЕГАИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопустимыеДниПДЗ_ДляАвтосогласованияПрямаяОтгрузка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимыеДниПДЗ_ДляАвтосогласованияЧерезМагазин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КаналПродаж</name>
    <type>
      <types>CatalogRef.битКаналыПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Территория</name>
    <type>
      <types>CatalogRef.битТерриторииПунктовНазначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопАналитика</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
      <types>CatalogRef.СегментыПартнеров</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_НастройкиСогласованияЗаказовКлиентов/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// ДопАналитика не должна хранить пустых ссылок 
	Если ЭтотОбъект.Количество() > 0
		И Отбор.Найти("ДопАналитика") <> Неопределено Тогда
		ДопАналитика = Отбор.ДопАналитика.Значение;
		Если Не ЗначениеЗаполнено(ДопАналитика)
			И ДопАналитика <> Неопределено Тогда
			Отбор.ДопАналитика.Значение = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.ДопАналитика) Тогда
			Если Запись.ДопАналитика <> Неопределено Тогда
				Запись.ДопАналитика = Неопределено;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(Запись.КаналПродаж)
			Или ЗначениеЗаполнено(Запись.Территория) Тогда
			Отказ = Истина;
			ТекстОшибки = НСтр("ru = 'Нельзя использовать доп.аналитику вместе с каналом и территорией'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Возврат;				 
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
